using System; 
/* 
* Программа со статическим классом Help и тремя статическими методами в нем. 
* Print - Выводит массив целых чисел на экран 
* MinToMax - Сортирует массив по возрастанию 
* MaxToMin - Сортирует массив по убыванию 
*/ 
namespace ConsoleApp6{ 
class Program{ 
static Random rand = new Random(); 
static void Main(string[] args){ 
int[] M = new int[10]; 
for (int i = 0; i < M.Length; i++){ 
M[i] = rand.Next(-100, 101); 
} 
Help.Print(M); 
Help.MaxToMin(M); 
Help.Print(M); 
Help.MinToMax(M); 
Help.Print(M); 
Console.ReadKey(true); 
} 
} 
static class Help { 
public static void MaxToMin(int[] Mas) { 
int t; 
for (int i = 0; i < Mas.Length - 1; i++){ 
for (int j = 0; j < Mas.Length - i - 1; j++){ 
if(Mas[j] < Mas[j + 1]) { 
t = Mas[j]; 
Mas[j] = Mas[j + 1]; 
Mas[j + 1] = t; 
} 
} 
} 
} 
public static void MinToMax(int[] Mas) { 
int t; 
for (int i = 0; i < Mas.Length - 1; i++){ 
for (int j = 0; j < Mas.Length - i - 1; j++){ 
if(Mas[j] > Mas[j + 1]) { 
t = Mas[j]; 
Mas[j] = Mas[j + 1]; 
Mas[j + 1] = t; 
} 
} 
} 
} 
public static void Print(int[] Mas) { 
for (int i = 0; i < Mas.Length; i++){ 
Console.Write($"{Mas[i]}\t"); 
} 
Console.WriteLine(); 
} 
} 
}









using System; 
/* 
* Написать программу находящую количество четных чисел в рандомном наборе из 10 чисел. 
* Для реализации задачи создать статический класс. В нем должно быть поле - количество четных чисел. 
* А также метод проверяющий четность числа. Остальные члены статического класса создать по желанию. 
*/ 

namespace ConsoleApp7{ 
class Program{ 
static Random rand = new Random(); 
static void Main(){ 
int t; 
string str; 
for (int i = 0; i < 10; i++){ 
t = rand.Next(-100, 101); 
str = $"Число {t} - "; 
if (M.IsEven(t)){ 
str += "четное"; 
} else { 
str += "нечетное"; 
} 
Console.WriteLine(str); 
} 
Console.WriteLine($"Всего четных чисел - {M.CountOfEvenNumbers}"); 
Console.ReadKey(true); 
} 
} 
static class M { 
public static int CountOfEvenNumbers; 
static M() { 
CountOfEvenNumbers = 0; 
} 
public static bool IsEven(int n) { 
if (n % 2 == 0) { 
CountOfEvenNumbers++; 
return true; 
} 
return false; 
} 
} 
}

















Задача для самостоятельного решения:
Написать программу для подсчета периметра и площади правильного n-угольника. 
Для этого реализовать статический класс Nangle. Для подсчета периметра и площади 
использовать только длину стороны и количество сторон.










Написать статический класс LIST - список гостей очного клуба. В нем должен 
находится метод IsGood, принимающий на вход имя посетителя и его возраст. Если 
человек старше 17 лет , то нужно записать его имя в статическое поле 
string[] Names. Написать статический метод вывода Имен всех посетителей и 
свойство считающее количество посетителей, которым разрешили посетить клуб.







Сейчас мы пойдем за грибами. Написать класс Basket. В нем должен находится 
массив из грибов (Масленок , Сыроежка, Белый Гриб, Подберезовик, Поганка, 
Псилоцибиновый Гриб, Красноголовик, Мухомор, Чага, Ложный Подберезовик, Моховик), 
также массив из съедобных грибов и несъедобных. Ваш сын принес вам корзину из 
30 рандомных грибов. Вы должны отсортировать съедобные грибы в одну корзину, а 
несъедобные в другую. Для этого все необходимые члены вы должны создать в 
классе Basket. Также реализуйте повтор решений. 





Как вы знаете наш жестокий мир таит много опасностей и радиация - не исключение. 
Вам требуется создать статический класс Human, со свойством Contamination - доза 
заражения организма радиацией (в микро Зирветах). Вам необходимо посчитать 
количество кг бананов, картофеля и моркови, которое нужно съесть чтобы умереть. 
Смертельная доза радиации 4000000 микро Зирветов. 1 кг бананов = 0.5 мкЗ, 1 кг 
картофеля = 1 мкЗ, 1 кг моркови - 1.2 мкЗв. Для реализации задачи создайте 
статические поля для каждого плода (кол-во килограммам способных убить человека.). 
Также для подсчета написать статические методы. Выходные данные в формате:
Плод - кол-во кг




Задачи на дома по строкам: 
Напишите программу распознающую российский номер телефона из входной строки.
Подходящие номера: 
9160202380
916 02 02 380
8916020230
8(916)-020-23-80
+79160202380
Неподходящие номера:
пеп356у3
20380
9=916/0202380
т.е. разрешены только цифры и знаки -()+ и пробел 





Напишите программу, отделяющую фамилию, имя и отчество в строке(всего N ФИО). 
А также проверить на правильность входные данные (разрешены только символы 
русского алфавита и пробел). Также все части ФИО должны быть в отдельных 
массивах. На каждую часть ФИО выделить 20 символов и записать их в столбики.ы
Пример выходных данных:
ИМЯ(тут \t) ФАМИЛИЯ(тут \t) ОТЧЕСТВО 
Павел (тут \t) Владимирович (тут \t) Иванов 








На вход подается строка. Напиши программу удаляющие все символы кроме чисел.











Вы преподаватель психологии, в ваше группе 10 человек. Вы должны написать 
программу ,записывающую в файл *.txt фамилии с рандомными оценками студентов 
от 0 до 10. Фамилии генерируйте рандомно из латинских символов.
Пример Данных в файле:
Иванов-4
Петров-9
Сидоров-1



Пример для строк:
Пример на инсерт
using System; 

namespace ConsoleApp8{ 
class Program{ 
static void Main(string[] args){ 
string str = "Ваша оценка - "; 
string mark = "8.7"; 
str = str.Insert(str.Length, mark); 
Console.WriteLine(str); 
Console.ReadKey(true); 
} 
} 
} 